blog/drafts/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-20 Fri 09:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Drafts</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Drafts</h1>
<p>
Current drafts.
</p>

<ul class="org-ul">
<li><a href="python-kanren.html">Understanding miniKanren with Python</a></li>
<li><a href="mnist_bayesian_mlp.html">MNIST and a Bayesian 3-layer MLP</a></li>
<li><a href="presidentielles-report-voix.html">Report des voix aux présidentielles</a></li>
<li><a href="understand-wavefunction-collapse.html">Wavefunction collapse and miniKanren</a></li>
<li><a href="solve-spelling-bee-kanren.html">Solve the Spelling Bee with miniKanren</a></li>
<li><a href="sparse-regression-aesara.html">Sparse regression in aesara</a></li>
<li><a href="introducing-birdland.html">Introducing Birdland</a></li>
<li><a href="aesara-target-jax-ir.html">aesara-target-jax-ir.html</a></li>
<li><a href="centered-non-centered.html">AeMCMC rewrites</a></li>
</ul>

<p>
(This is not automatically updated)
</p>

<div id="outline-container-org9eb16c6" class="outline-2">
<h2 id="org9eb16c6">On finding the right representation for things</h2>
<div class="outline-text-2" id="text-org9eb16c6">
<p>
Aesara allows to model:
</p>
<ul class="org-ul">
<li></li>
<li><a href="../../20220824143353-hidden_markov_models_in_aesara.html#ID-41dbc34a-2004-4b65-99fc-cc73c0aeef76">Hidden Markov Models in Aesara</a></li>
<li>Bayesian non-parametrics</li>
</ul>

<p>
Without any workaround. You really just write the model as it is.
</p>
</div>
</div>

<div id="outline-container-org7683c23" class="outline-2">
<h2 id="org7683c23">On emacs</h2>
<div class="outline-text-2" id="text-org7683c23">
<p>
<i>Caution:</i> This post may be written with the naivety of someone who has just discovered a tool, although it has been one year.
</p>

<p>
The secret to understanding code is to simply <i>use it</i>, play with it. Notebooks are great for that. Original workflow was to have everything in a script, execute the script OR look into a REPL. Notebooks allowed to develop a <i>narrative</i> around the code. A form of literate pogramming.
</p>

<p>
I felt I was held by a lot of friction with notebooks, which probably made me test thing a lot less than I should have:
</p>
<ul class="org-ul">
<li>You have to start a new session in the browser;</li>
<li><i>Searching</i> notebooks is hard;</li>
<li>You don't have access to vim keybindings, which quickly gets frustrating;</li>
<li>You don't easily have access</li>
<li>Versioning / publishing is a pain because of the JSON format;</li>
</ul>

<p>
It is funny, looking back at the developement of Jupyter and its ecosystem that they tried to re-produce everything that was already available with org-babel:
</p>
<ul class="org-ul">
<li>Publishing to LaTeX, HTML, etc.</li>
<li>Support for multiple languages (JUliaPYthon)</li>
<li>Versioning (jupytext)</li>
</ul>

<p>
Emacs is a great operating system. It may be the greatest operating system ever developed for people who only work with text. It even comes bundled with the best text editor (vim). But two things:
</p>

<ol class="org-ol">
<li>Relatively few people use emacs. Even after 10 years of tinkering with Vim I was hesitant to switch to emacs, which feels quite terrifying for most people.</li>
<li>People keep re-inventing the wheel, namely features that have been in emacs for a long time.</li>
</ol>

<p>
I am going to leave my elitist-bs aside for a second: I have to admit that people are <b><b>right</b></b> to be scared about emacs. It tooks me weeks to get the same level of productivity as I had with Vim before, many months before I start recouping the time spent. That's <b>a lot of time</b>: people are smart, but they have a job, a family, other interests in life. It should not be <i>hard</i> to use emacs.
</p>

<p>
The philosophy so far has been to bring people to emacs' level. Some cult-ish BS where everyone makes everyong else believe that you need to <i>deserve</i> emacs if you want to use it, and emacs should NOT be ternished by some n00b graphical interface and primitive text editing experience.
</p>

<p>
People with a lot of good will (the best) will take people's hand and write lengthy tutorials about how you can get to a point where you can be slightly
</p>

<p>
Emacs should come with a distribution that does the same thing as other text editors: the interface is simple, but bells and whistles are available should you need them.
</p>

<p>
I think emacs is very powerful, and it is a waste of everyone's time that we haven't made easy-to-use applications on top of this text-processing machine.
</p>
</div>
</div>
</div>
</body>
</html>